//---------------------------------------------------------------------------
#ifndef DataWA_AreaH
#define DataWA_AreaH
#include "DataWA.h"
//---------------------------------------------------------------------------
// Класс предназначен для отбора данных выделеной области 
//---------------------------------------------------------------------------
class DataWA_Area : public DataWA {

private:
  // Указатель на настройки пользователя
  const SettingsApprox2D3D* _settings;

public:
  // Конструктор
  DataWA_Area(const Data *data, const SettingsApprox2D3D *settings);
	// Деструктор
  ~DataWA_Area();
  // Отбор данных
  virtual int Create();

};
//---------------------------------------------------------------------------
#endif
