//---------------------------------------------------------------------------
#include <vcl.h>
#pragma hdrstop
#include "SettingsForLevels.h"
//---------------------------------------------------------------------------
#pragma package(smart_init)

//---------------------------------------------------------------------------
// Добавить уровень
//---------------------------------------------------------------------------
void TSettingsForLevels::Add(TLevelSettings LS)
{
    vLevelSettings.push_back(LS);
}
//---------------------------------------------------------------------------
// Очистить
//---------------------------------------------------------------------------
void TSettingsForLevels::Clear()
{
   vLevelSettings.erase(vLevelSettings.begin(), vLevelSettings.end());
   vLevelSettings.swap(v_tmp);
}
//---------------------------------------------------------------------------
// Получить уровень по индексу
//---------------------------------------------------------------------------
TLevelSettings TSettingsForLevels::getLevel(unsigned int i)
{
   TLevelSettings LS;
   if (i <= vLevelSettings.size())
   {
     LS = vLevelSettings[i];
     return LS;
   }
   else
     return LS;
}
//---------------------------------------------------------------------------
// Получить кол-во уровней
//---------------------------------------------------------------------------
int TSettingsForLevels::getCountLevels()
{
  return vLevelSettings.size();
}
//---------------------------------------------------------------------------
